/* 
  Localizable.strings (Japanese)
  MidTVWallpaper
*/

// MARK: - General
"app.name" = "AI Stream Wallpaper";
"app.version" = "バージョン";

// MARK: - Common
"common.add" = "追加";
"common.cancel" = "キャンセル";
"common.close" = "閉じる";
"common.delete" = "削除";
"common.save" = "保存";
"common.done" = "完了";
"common.ok" = "OK";

// MARK: - Main Window Sidebar
"main.content" = "コンテンツ";
"main.settings" = "設定";
"main.library" = "ライブラリ";
"main.streaming" = "ストリーミング";
"main.display" = "ディスプレイ";
"main.shortcuts" = "ショートカット";
"main.general" = "一般";

// MARK: - Menu Bar
"menu.midjourneyTV" = "Midjourney TV";
"menu.library" = "ライブラリ";
"menu.play" = "再生";
"menu.pause" = "一時停止";
"menu.saveVideo" = "現在の動画を保存";
"menu.copyPrompt" = "プロンプトをコピー";
"menu.mute" = "ミュート";
"menu.unmute" = "ミュート解除";
"menu.shuffle" = "シャッフル";
"menu.sequential" = "順番通り";
"menu.playOrder" = "再生順序";
"menu.repeat" = "リピート";
"menu.switchToLibrary" = "ライブラリに切替";
"menu.switchToStreaming" = "ストリーミングに切替";
"menu.openLibrary" = "ライブラリを開く...";
"menu.openSettings" = "設定...";
"menu.settings" = "設定...";
"menu.launchAtLogin" = "ログイン時に起動";
"menu.quit" = "終了";
"menu.previous" = "前へ";
"menu.next" = "次へ";
"menu.noVideo" = "動画がありません";
"menu.videosInLibrary" = "本の動画";
"menu.streamingConnection" = "ストリーミング接続";
"menu.connected" = "接続中";
"menu.disconnected" = "未接続";
"menu.autoSaveCount" = "自動保存上限";
"menu.videos" = "本";
"menu.saveToDownloads" = "ダウンロードに保存";
"menu.hideCurrentVideo" = "この動画を非表示";

// MARK: - Library
"library.title" = "ライブラリ";
"library.search" = "検索...";
"library.showFavorites" = "お気に入りのみ表示";
"library.empty" = "ライブラリが空です";
"library.noResults" = "結果が見つかりません";
"library.emptyTip" = "ストリーミング接続を有効にすると動画が自動保存されます";
"library.enableStreaming" = "ストリーミング接続を有効化";
"library.addLocal" = "ローカル動画を追加";
"library.setAsWallpaper" = "壁紙に設定";
"library.close" = "閉じる";
"library.videos" = "本の動画";
"library.favorites" = "お気に入り";
"library.plays" = "回再生";
"library.addToFavorites" = "お気に入りに追加";
"library.removeFromFavorites" = "お気に入りから削除";
"library.showInFinder" = "Finderで表示";
"library.delete" = "削除";
"library.refresh" = "更新";
"library.copyPrompt" = "プロンプトをコピー";
"library.dislike" = "非表示にする";
"library.openInMidjourney" = "Midjourneyで開く";

// MARK: - Sort Options
"sort.recentFirst" = "最近保存した順";
"sort.oldestFirst" = "古い順";
"sort.nameAZ" = "名前 (A-Z)";
"sort.nameZA" = "名前 (Z-A)";
"sort.mostPlayed" = "再生回数順";
"sort.shortest" = "短い順";
"sort.longest" = "長い順";

// MARK: - Streaming Settings
"streaming.connectionStatus" = "接続状態";
"streaming.connected" = "接続中";
"streaming.disconnected" = "未接続";
"streaming.connect" = "接続";
"streaming.disconnect" = "切断";
"streaming.source" = "動画ソース";
"streaming.default" = "デフォルト";
"streaming.addCustomUrl" = "カスタムURLを追加";
"streaming.enterUrl" = "URLを入力...";
"streaming.autoSave" = "自動保存";
"streaming.autoSaveEnabled" = "ライブラリに保存";
"streaming.autoSaveEnabledInfo" = "無効にすると、ライブラリに保存せず直接再生します。";
"streaming.maxVideos" = "最大動画数";
"streaming.autoSaveInfo" = "新しい動画は自動的にライブラリに保存され、古い動画は制限を維持するために削除されます。";
"streaming.description" = "ストリーミング接続で動画を自動的にライブラリにダウンロードします";
"streaming.connection" = "接続";
"streaming.enableConnection" = "ストリーミング接続を有効化";
"streaming.online" = "オンライン";
"streaming.offline" = "オフライン";
"streaming.autoSaveCount" = "最新の動画を保持";
"streaming.autoSaveTip" = "新しい動画が自動保存され、上限を超えると古いものが削除されます";
"streaming.libraryCount" = "現在のライブラリ";
"streaming.sources" = "動画ソース";
"streaming.sourceName" = "名前";
"streaming.sourceURL" = "URL";
"streaming.add" = "追加";

// MARK: - Display Settings
"display.preview" = "プレビュー";
"display.adjustments" = "調整";
"display.transparency" = "透明度";
"display.brightness" = "明るさ";
"display.saturation" = "彩度";
"display.blur" = "ぼかし";
"display.presets" = "プリセット";
"display.preset.default" = "デフォルト";
"display.preset.subtle" = "控えめ";
"display.preset.dim" = "暗め";
"display.preset.ambient" = "アンビエント";
"display.preset.focus" = "集中";
"display.preset.vivid" = "鮮やか";
"display.preset.cinema" = "シネマ";
"display.preset.neon" = "ネオン";
"display.preset.dreamy" = "ドリーミー";
"display.preset.night" = "ナイト";
"display.preset.warm" = "ウォーム";
"display.preset.retro" = "レトロ";
"display.preset.cool" = "クール";
"display.preset.soft" = "ソフト";

// MARK: - General Settings
"general.language" = "言語";
"general.selectLanguage" = "言語を選択";
"general.systemDefault" = "システム設定";
"general.languageInfo" = "一部の変更はアプリの再起動が必要な場合があります";
"general.playback" = "再生";
"general.repeatMode" = "リピートモード";
"general.shuffle" = "シャッフル";
"general.autoPlay" = "起動時に自動再生";
"general.displayMode" = "表示モード";
"general.useAsWallpaper" = "壁紙として使用";
"general.useAsWallpaperInfo" = "動画をデスクトップの背景として表示します";
"general.useAsScreensaver" = "スクリーンセーバーとして使用";
"general.useAsScreensaverInfo" = "システムがアイドル状態の時に動画を表示します";
"general.screensaverIdleTime" = "開始時間";
"general.minutes1" = "1分";
"general.minutes2" = "2分";
"general.minutes5" = "5分";
"general.minutes10" = "10分";
"general.minutes15" = "15分";
"general.minutes30" = "30分";
"general.startup" = "起動";
"general.launchAtLogin" = "ログイン時に起動";
"general.launchAtLoginInfo" = "ログイン時にAI Stream Wallpaperを起動します";
"general.startMinimized" = "最小化で起動";
"general.startMinimizedInfo" = "起動時にウィンドウを表示しない";
"general.about" = "このアプリについて";
"general.version" = "バージョン";
"general.librarySize" = "ライブラリサイズ";
"general.storageUsed" = "使用容量";
"general.clearLibrary" = "ライブラリをクリア";
"general.clearLibraryConfirm" = "ライブラリをクリアしますか？";
"general.clearLibraryWarning" = "ライブラリのすべての動画が削除されます。この操作は取り消せません。";
"general.audio" = "オーディオ";
"general.mute" = "ミュート";
"general.playbackInfo" = "ライブラリの動画は常にループ再生されます";
"general.showNotification" = "動画保存時に通知を表示";

// MARK: - Notifications
"notification.saved" = "動画を保存しました";
"notification.saveFailed" = "保存に失敗";
"notification.copied" = "✓ コピーしました";
"notification.copyFailed" = "⚠ コピーに失敗";
"notification.promptCopied" = "プロンプトをクリップボードにコピーしました";
"notification.promptNotFound" = "プロンプトが見つかりません";
"notification.noWebView" = "Webビューが利用できません";
"notification.noVideoURL" = "動画URLが見つかりません。動画の読み込みをお待ちください。";

// MARK: - Settings
"settings.title" = "設定";
"settings.general" = "一般";
"settings.streaming" = "ストリーミング";
"settings.overlay" = "ディスプレイ";

// MARK: - Language
"language.title" = "言語";
"language.system" = "システム設定";
"language.english" = "English";
"language.korean" = "한국어";
"language.japanese" = "日本語";

